int ir_out = 13;
 
// エアコンオン（暖房）
unsigned int dd[] = {384,186,51,46,48,137,51,46,47,141,48,46,47,138,51,46,47,138,51,46,47,138,51,46,47,138,51,138,51,43,44,148,51,39,51,137,51,142,50,134,51,137,51,43,54,43,47,137,52,137,51,43,43,53,51,43,47,42,51,137,52,46,50,43,47,47,47,138,51,42,51,141,51,43,48,42,51,46,48,42,42,54,51,134,51,42,52,45,48,42,54,134,49,48,48,43,51,46,48,141,51,42,48,42,51,42,51,42,51,137,55,42,48,46,48,42,56,38,51,46,51,43,51,42,48,42,56,38,56,38,51,46,45,48,40,54,48,137,56,38,51,46,51,43,50,40,56,41,53,37,52,42,42,54,51,43,50,39,56,37,56,132,44,54,51,42,50,39,56,38,51,42,56,41,45,49,51,42,52,38,56,38,56,133,54,43,47,138,56,132,56,132,43,145,52,137,56,42,51,42,51,42,52,132,56,38,56,41,48,46,50};

 
// セットアップ
void setup() {
  pinMode(ir_out, OUTPUT);
}
 
// dataからリモコン信号を送信
void heater() {
  int dataSize = sizeof(dd) / sizeof(dd[0]);
  for (int cnt = 0; cnt < dataSize; cnt++) {
    unsigned long len = dd[cnt]*10;  // dataは10us単位でON/OFF時間を記録している
    unsigned long us = micros();
    do {
      digitalWrite(ir_out, 1 - (cnt&1)); // cntが偶数なら赤外線ON、奇数ならOFFのまま
      delayMicroseconds(8);  // キャリア周波数38kHzでON/OFFするよう時間調整
      digitalWrite(ir_out, 0);
      delayMicroseconds(7);
    } while (long(us + len - micros()) > 0); // 送信時間に達するまでループ
  }
}
 
void loop() {

  heater();

  delay(5000);
}
